In [3]:
import pandas as pd
from pandas import *
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'], 
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [5]:
### Filter out some columns
data[['one', 'two']]

          one  two
Ohio        0    1
Colorado    4    5
Utah        8    9
New York   12   13

In [6]:
### Filter out some rows
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [13]:
### Filter out rows based on condition(s) on column(s)
data[(data['four'] > 7) & (data['three'] > 7)]

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [8]:
### Filter out rows and columns together based on condition on column
data.ix[data.three > 5, :3]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [14]:
### Filter out rows and columns together based on condition on column
data.ix[(data['one'] > 7) & (data['two'] > 7), :3]

          one  two  three
Utah        8    9     10
New York   12   13     14